IvanOrfanidi/SVD_Files/ST/STM32L4x9.svd
        <register>
          <name>LUT1000H</name>
          <displayName>LUT1000H</displayName>
          <description>Graphic MMU LUT entry 1000
          high</description>
          <addressOffset>0x2F44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1001H</name>
          <displayName>LUT1001H</displayName>
          <description>Graphic MMU LUT entry 1001
          high</description>
          <addressOffset>0x2F4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1002H</name>
          <displayName>LUT1002H</displayName>
          <description>Graphic MMU LUT entry 1002
          high</description>
          <addressOffset>0x2F54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1003H</name>
          <displayName>LUT1003H</displayName>
          <description>Graphic MMU LUT entry 1003
          high</description>
          <addressOffset>0x2F5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1004H</name>
          <displayName>LUT1004H</displayName>
          <description>Graphic MMU LUT entry 1004
          high</description>
          <addressOffset>0x2F64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1005H</name>
          <displayName>LUT1005H</displayName>
          <description>Graphic MMU LUT entry 1005
          high</description>
          <addressOffset>0x2F6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1006H</name>
          <displayName>LUT1006H</displayName>
          <description>Graphic MMU LUT entry 1006
          high</description>
          <addressOffset>0x2F74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1007H</name>
          <displayName>LUT1007H</displayName>
          <description>Graphic MMU LUT entry 1007
          high</description>
          <addressOffset>0x2F7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1008H</name>
          <displayName>LUT1008H</displayName>
          <description>Graphic MMU LUT entry 1008
          high</description>
          <addressOffset>0x2F84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1009H</name>
          <displayName>LUT1009H</displayName>
          <description>Graphic MMU LUT entry 1009
          high</description>
          <addressOffset>0x2F8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1010H</name>
          <displayName>LUT1010H</displayName>
          <description>Graphic MMU LUT entry 1010
          high</description>
          <addressOffset>0x2F94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1011H</name>
          <displayName>LUT1011H</displayName>
          <description>Graphic MMU LUT entry 1011
          high</description>
          <addressOffset>0x2F9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1012H</name>
          <displayName>LUT1012H</displayName>
          <description>Graphic MMU LUT entry 1012
          high</description>
          <addressOffset>0x2FA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1013H</name>
          <displayName>LUT1013H</displayName>
          <description>Graphic MMU LUT entry 1013
          high</description>
          <addressOffset>0x2FAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1014H</name>
          <displayName>LUT1014H</displayName>
          <description>Graphic MMU LUT entry 1014
          high</description>
          <addressOffset>0x2FB4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1015H</name>
          <displayName>LUT1015H</displayName>
          <description>Graphic MMU LUT entry 1015
          high</description>
          <addressOffset>0x2FBC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1016H</name>
          <displayName>LUT1016H</displayName>
          <description>Graphic MMU LUT entry 1016
          high</description>
          <addressOffset>0x2FC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1017H</name>
          <displayName>LUT1017H</displayName>
          <description>Graphic MMU LUT entry 1017
          high</description>
          <addressOffset>0x2FCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1018H</name>
          <displayName>LUT1018H</displayName>
          <description>Graphic MMU LUT entry 1018
          high</description>
          <addressOffset>0x2FD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1019H</name>
          <displayName>LUT1019H</displayName>
          <description>Graphic MMU LUT entry 1019
          high</description>
          <addressOffset>0x2FDC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1020H</name>
          <displayName>LUT1020H</displayName>
          <description>Graphic MMU LUT entry 1020
          high</description>
          <addressOffset>0x2FE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1021H</name>
          <displayName>LUT1021H</displayName>
          <description>Graphic MMU LUT entry 1021
          high</description>
          <addressOffset>0x2FEC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1022H</name>
          <displayName>LUT1022H</displayName>
          <description>Graphic MMU LUT entry 1022
          high</description>
          <addressOffset>0x2FF4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1023H</name>
          <displayName>LUT1023H</displayName>
          <description>Graphic MMU LUT entry 1023
          high</description>
          <addressOffset>0x2FFC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
